#pragma once
#include	<stdio.h>

struct ST {
	//基本データ------------------------------------------------------------
	int ID;				//キャラクターID
	const char* name;	//キャラクター名
	//ステータス------------------------------------------------------------
	int HP;				//体力
	int ATTACK;			//攻撃力
	int DEFENCE;		//防御力
	float SPEED;		//速度＜－値を使ってフィールドでの速度も変える
};
//--------------------------------------------------------------------------
struct ATTRIBUTE {
	//基本データ------------------------------------------------------------
	int ID;					//属性ID
	const char* attrName;	//属性名
	//属性相性--------------------------------------------------------------
	float normal;	//対無属性倍率
	float fire;		//対炎倍率
	float water;	//対水倍率
	float ice;		//対氷倍率
	float thunder;	//対雷倍率
};
//--------------------------------------------------------------------------